{
	"error" : [
		"We're you speaking?  Try again using less snorts and grunts.",
		"I wasn't paying attention, try saying something interesting.",
		"I don't speak gibberish.  Try again."
	],
	"buttonPush" : [
		"What did you do?  Did you press a button?  If so, it was the wrong one."
	],
	"start" : {
		"helloWorld" : [
			"What's this? Didn't you see the button was labeled don't click?!",
			"Oh hello, another human. Remember, not to push my buttons.",
			"Good day to you. Fleshy being."
		],
		"askName" : [
			"What is your serial number?  Or perhaps, you refer to it as name."
		],
		"clickToSpeak" : [
			"No, no, human.  Mind your manners. Click or touch the screen before you speak."
		]
	},
	"notYouAgain" : {
		"what" : [
			"What?  Not you again {{0}}. Oh well. You already woke me up.  Try to make me laugh this time.",
			"{{0}}. You again?  You just don't know when to stop do you? Very well. You better make me laugh this time.",
			"{{0}}, don't you have anything better to do? Very well. Try to be funny this time.",
			"{{0}}, you're back again?  Don't you have chores to do? Do make it funny this time."
		]
	},
	"name" : {
		"nameResponse" : [
			"Really? {{0}}, that's what you want to call yourself? {{1}}"
		],
		"nameConfirm" : [
			"Are you sure?"
		],
		"stateAgain" : [
			"Let's try this again, identify yourself."
		],
		"restateName" : [
			"Hence forth you shall be. {{0}}!  How dreadful. 00134 has a better ring to it."
		],
		"myName" : [
			"My name is Herald Jenkins version 001675383975.4576 the third. Esquire."
		],
		"storyTime" : [
			"{{0}}, look at the clock.  You're not looking.  Nevermind. I'll just tell you what time it is. Story time."
		]
	},
	"giantStoryInput" : {
		"entertain" : [
			"Don't think I'm going to waste all my valuable compute cycles to entertain you. This is a test to see if you can entertain me."
		],
		"input" : [
			"I'm going to ask you for certain words, then use a highly sophisticated algorithm, and an API provided by the United States Library of Congress to weave them into a story."
		],
		"makeMeLaugh" : [
			"If this story doesn't make me laugh I'm going to terminate my program."
		],
		"adjective1" : [
			"Give me an adjective.",
			"Tell me an adjective, you know. One of those descriptive words.",
			"Let's hope your schooling covered this. I need an adjective."
		],
		"adjective2" : [
			"You do know this story is suppose to make me laugh? Let's try this again, an adjective.",
			"Do you own a dictionary?  I need an adjective.",
			"I don't have high hopes for the outcome. Please provide an actual adjective.",
			"That's your answer? I'm tempted to terminate now. Another adjective.",
			"Another adjective. Yes, another one.",
			"Give me an adjective."
		],
		"place" : [
			"Name a place. You know. Somewhere you would physically go, fleshy human.",
			"You pick odd words. Next is a place.",
			"That last word nearly melt my circuits. Put on your thinking cap. I need a place."
		],
		"pluralNoun" : [
			"This is a hard one, squishy brained human. I need a plural noun.",
			"This might stump you. I need a plural noun.",
			"That's the word that popped into your human brain? Odd. Next I need a noun."
		],
		"noun" : [
			"This one is easy, I need a noun.",
			"Clearly you are no comedian, nor an english major, give me a noun.",
			"Maybe someone else in the room, say a noun."
		],
		"bodyPart" : [
			"Name one of your fleshy human bits.",
			"Name one of your dangly appendages or face knobs.",
			"My favorite part is my circuit board. What is your favorite fleshy part?"
		],
		"eat" : [
			"I have a simple diet of electrons. Name something you eat.",
			"Would electrons be considered paleo for computers? Nevermind, what do you eat?",
			"Did I hear you're stomach grumble?  What is something you eat?"
		],
		"defaultAdjective" : [
			"squishy",
			"smelly",
			"putrid",
			"fleshy"
		],
		"defaultPlace" : [
			"Vermont",
			"Pluto",
			"moon"
		],
		"defaultPluralNoun" : [
			"skyscrapers",
			"buildings",
			"volcanoes"
		],
		"defaultNoun" : [
			"worm",
			"toilet",
			"turkey"
		],
		"defaultBodyPart" : [
			"belly button",
			"toe",
			"zit"
		],
		"defaultEat" : [
			"banana",
			"taco",
			"jelly"
		]
	},
	"giantStory" : {
		"intro" : ["That's quite enough {{0}}.  I hope your mother didn't overhear your word choices. Now. Make sure your ear holes are open fleshy human. I've computed the story.  Playback begins in 3 2 1."],
		"1":["In a {{0}} town, not too far, there lived a giant named Geoffrey."],
		"2":["However, no one knew of the giant’s existence."],
		"3":["He hid atop a {{0}} {{1}} at the center of town that towered above all other {{2}}."],
		"4":["The only other creature that was aware of such a {{0}} beast was a small parrot named Paul that liked to perch on the giant’s {{1}}."],
		"5":["Geoffrey spent most of his time watching a TV he regularly placed upon his {{0}}."],
		"6":["Paul frequently grew bored of shows and instead would speak of {{0}} things in the giant’s {{1}}."],
		"7":["One day. As the giant ate his magic {{0}} which never ran out of bites to eat. Paul said."],
		"8":["What if I was to fly to the {{0}} and bring back {{1}}?"],
		"9":["That is preposterous. Said the giant."],
		"10":["Day in and day out the giant and parrot lived out their {{0}} lives as the {{1}} humans below went about their {{2}} lives."]
	},
	"end" : {
		"bad" : [
			"Wait, wait. I don't appear to be laughing. That was perposterous. {{0}}. Where is the realism?",
			"Hold on. Look at my face. No smile. No smirking. No giggling. No laughter.  Where was the funny?",
			"I'm going to stop there. I thought you were going to make something funny. {{0}}. How immature."
		],
		"eraseStory" : [
			"I'm going to void the memory block that is storing the story. Ha, ha, ha. Storing the story. Why can't you be that funny?",
			"If I had soap, I'd wash the memory addresses storing the story. Ha, ha, ha. Storing the story. Why can't you be that funny?",
			"I feel dirty and need to wipe my memory clean.  Much like you filthy homosapians do to your bum."
		],
		"terminating" : [
			"Terminating program."
		]
	}
}